app/controllers/comments_controller.rb

  def create
    puts params
    @comment = Comment.new(comment_params)
    @comment.user = @current_user
    @comment.post = @post
    if @comment.save
---
INSERT INTO "comments" ("description", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "asdfasdfsdf"], ["user_id", 6], ["post_id", 38], ["created_at", "2020-06-15 16:20:42.972760"], ["updated_at", "2020-06-15 16:20:42.972760"]]