app/controllers/posts_controller.rb

INSERT INTO "posts" ("name", "description", "startdate", "enddate", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    if @post.save

UPDATE "posts" SET "startdate" = $1, "enddate" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["startdate", "6/24/20"], ["enddate", "6/24/20"], ["updated_at", "2020-06-16 15:01:00.908752"], ["id", 15]]
---
  def update
    if @post.update(post_params)